# Pandas Cheatsheet

In [2]:
import pandas as pd

DataFrame:

矩阵(二维表)Table.

Tensor 张量:

标量 - 0阶张量 - 常数

向量 - 1阶张量 - 1维数组

矩阵 - 2阶张量 - 2维数组 - Table

3阶张量 - 图像 - RGB

4阶张量 - 图像数组 - Batch

In [ ]:
BGD / SGD / Mini-Batch:

为了更好的梯度下降:
    
Loss的梯度 = 每一条训练数据的Loss的梯度平均后的结果

使用多少条数据来求平均的梯度?

BGD - 全部数据 - 缺点: 慢 - 优点: 梯度最合适本数据集

SGD - 只选用1个数据 - 优点: 快 - 缺点: 难以代表整个数据集
        
MiniBatch - 选用n个数据点-可调节,其中n是Batch_Size

注意:当前的学习器SGD可以代表BGD/SGD/MiniBatch

In [3]:
data0 ={
    'a':[1,2,3],
    'b':[4,5,6],
    'c':['Bob','Alice','Jack']
}

In [4]:
pd.DataFrame(data0)

   a  b      c
0  1  4    Bob
1  2  5  Alice
2  3  6   Jack

In [5]:
data={'name': ['Alice', 'Bob', 'Charles', 'David', 'Eric'],
        'year': [2017, 2017, 2017, 2017,2017],#2017
        'salary': [40000, 24000, 31000, 20000, 30000],
        'pair':[{'a':1},{'a':2},{'a':3},{'a':4},{'a':5}]
       }

In [8]:
d = pd.DataFrame(data)

In [9]:
d.pair

0    {'a': 1}
1    {'a': 2}
2    {'a': 3}
3    {'a': 4}
4    {'a': 5}
Name: pair, dtype: object

In [10]:
d.name

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [11]:
d['name']

0      Alice
1        Bob
2    Charles
3      David
4       Eric
Name: name, dtype: object

In [12]:
type(d.name)

pandas.core.series.Series

## 薪水大于20000 的人都有谁?

query

python.query()函数对数据框进行（挑选行）的操作

In [27]:
d

      name  year  salary      pair
0    Alice  2017   40000  {'a': 1}
1      Bob  2017   24000  {'a': 2}
2  Charles  2017   31000  {'a': 3}
3    David  2017   20000  {'a': 4}
4     Eric  2017   30000  {'a': 5}

In [17]:
d.query('salary>20000')['name']

0      Alice
1        Bob
2    Charles
4       Eric
Name: name, dtype: object

In [19]:
d[d.salary > 20000]

      name  year  salary      pair
0    Alice  2017   40000  {'a': 1}
1      Bob  2017   24000  {'a': 2}
2  Charles  2017   31000  {'a': 3}
4     Eric  2017   30000  {'a': 5}

In [20]:
d1 = d[d.salary > 20000]

### 只获得Eric的信息

In [34]:
d[d.name == 'Eric']

   name  year  salary      pair
4  Eric  2017   30000  {'a': 5}

### 联合查找: 名字叫Bob,且薪水大于20000

In [41]:
d.query("name == 'Bob' and salary > 20000")

  name  year  salary      pair
1  Bob  2017   24000  {'a': 2}

## 类操作

select name, year from T where salary> 20000 and name = 'Eric'

.filter()

In [43]:
d.filter(items = ['name','year'])

      name  year
0    Alice  2017
1      Bob  2017
2  Charles  2017
3    David  2017
4     Eric  2017

In [44]:
d[['name','year']]

      name  year
0    Alice  2017
1      Bob  2017
2  Charles  2017
3    David  2017
4     Eric  2017

In [50]:
d.query("salary > 20000 and name == 'Eric'")[['name','year']]

   name  year
4  Eric  2017

### 模糊查找

.filter(like,axis)

In [53]:
d.filter(like = '2',axis = 0)

      name  year  salary      pair
2  Charles  2017   31000  {'a': 3}

In [54]:
d.filter(like = 'ala',axis =1)

   salary
0   40000
1   24000
2   31000
3   20000
4   30000

## 分组
.groupby([])|

In [57]:
df1 = pd.DataFrame( { 
    "Name" : ["Alice", "Ada", "Mallory", "Mallory", "Billy" , "Mallory"] , 
    "City" : ["Sydney", "Sydney", "Paris", "Sydney", "Sydney", "Paris"]} )

In [58]:
df1

      Name    City
0    Alice  Sydney
1      Ada  Sydney
2  Mallory   Paris
3  Mallory  Sydney
4    Billy  Sydney
5  Mallory   Paris

#### 各个城市都有多少人

In [61]:
df1.groupby(['City']).count()

        Name
City
Paris      2
Sydney     4

In [62]:
df1.groupby(['City','Name']).count()

Empty DataFrame
Columns: []
Index: [(Paris, Mallory), (Sydney, Ada), (Sydney, Alice), (Sydney, Billy), (Sydney, Mallory)]

## 统计量分析

In [65]:
d.describe()

         year        salary
count     5.0      5.000000
mean   2017.0  29000.000000
std       0.0   7615.773106
min    2017.0  20000.000000
25%    2017.0  24000.000000
50%    2017.0  30000.000000
75%    2017.0  31000.000000
max    2017.0  40000.000000

### 数值统计

In [130]:
import numpy as np

In [133]:
df2 = pd.DataFrame({'key1':['a', 'a', 'b', 'b', 'a'],
                   'key2':['one', 'two', 'one', 'two', 'one'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5)})

In [134]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  0.117009
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

### 基于属性Key1的类型a和b各自data1和data2的均值和标准差是多少

In [135]:
df2.groupby(['key1']).mean()

         data1     data2
key1
a    -0.547269 -0.203741
b    -1.142152  0.187622

In [136]:
df2.groupby(['key1']).std()

         data1     data2
key1
a     1.572136  0.754669
b     0.643070  0.076510

### 基于key1 和 key2 的不同组合,data1和data2的均值和标准差

In [137]:
df2.groupby(['key1','key2']).mean()

              data1     data2
key1 key2
a    one   0.227478 -0.364116
     two  -2.096764  0.117009
b    one  -0.687432  0.241723
     two  -1.596871  0.133521

### 对于Series的类型直接求sum

In [138]:
df2.data1.sum()

-3.926111530660827

In [139]:
df2[['data1','data2']].sum()

data1   -3.926112
data2   -0.235978
dtype: float64

## 排序

In [140]:
df2.data1.sort_values()

1   -2.096764
3   -1.596871
2   -0.687432
4   -0.591613
0    1.046569
Name: data1, dtype: float64

In [141]:
df2.sort_values(by='data2')

  key1 key2     data1     data2
4    a  one -0.591613 -1.065803
1    a  two -2.096764  0.117009
3    b  two -1.596871  0.133521
2    b  one -0.687432  0.241723
0    a  one  1.046569  0.337572

In [142]:
df2.sort_values(by='key2')

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
2    b  one -0.687432  0.241723
4    a  one -0.591613 -1.065803
1    a  two -2.096764  0.117009
3    b  two -1.596871  0.133521

### 多属性的排序

In [143]:
df2.sort_values(by=['key1','key2'])

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
4    a  one -0.591613 -1.065803
1    a  two -2.096764  0.117009
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521

### 逆序

In [144]:
df2.sort_values(by='data1',ascending=False)

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
4    a  one -0.591613 -1.065803
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
1    a  two -2.096764  0.117009

## 对于数据的行与列的增删改查

## 数据行选择器

iloc -- indexed location

loc -- location(using index name)

In [145]:
df2.iloc[2]

key1            b
key2          one
data1   -0.687432
data2    0.241723
Name: 2, dtype: object

In [146]:
df2.loc[2]

key1            b
key2          one
data1   -0.687432
data2    0.241723
Name: 2, dtype: object

In [147]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  0.117009
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

In [148]:
df2.groupby('key1').count().loc['a']

key2     3
data1    3
data2    3
Name: a, dtype: int64

In [149]:
df2.groupby('key1').count().iloc[0]

key2     3
data1    3
data2    3
Name: a, dtype: int64

## 对于cell进行选择

iloc[row,col]

In [150]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  0.117009
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

In [151]:
df2.iloc[1,1]

'two'

In [152]:
df2.iloc[:,3] #全部行的第三列

0    0.337572
1    0.117009
2    0.241723
3    0.133521
4   -1.065803
Name: data2, dtype: float64

In [153]:
df2['data2']

0    0.337572
1    0.117009
2    0.241723
3    0.133521
4   -1.065803
Name: data2, dtype: float64

### 选择df2的前两行

In [154]:
df2.iloc[:2,:]

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  0.117009

### 选择df2的前两行和后两列

In [155]:
df2.iloc[:2,-2:]

      data1     data2
0  1.046569  0.337572
1 -2.096764  0.117009

### 数据的修改

.at[row,col] = ?

.iat[irow,icol] =?

In [156]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  0.117009
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

In [157]:
df2.at[1,'data2'] = 2

In [158]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two -2.096764  2.000000
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

In [159]:
df2.iat[1,2]=5

In [160]:
df2

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two  5.000000  2.000000
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803

### 增加行

.append()

对于DataFrame,每一行代表着一个对象,对象里面每一个属性,与表中的列相对应,所以添加1行其实就是添加1个json

In [165]:
df3 = df2 .append({'data1':1.2,'data2':2.4,'key1':'c','key2':'three'},ignore_index=True)

In [166]:
df3

  key1   key2     data1     data2
0    a    one  1.046569  0.337572
1    a    two  5.000000  2.000000
2    b    one -0.687432  0.241723
3    b    two -1.596871  0.133521
4    a    one -0.591613 -1.065803
5    c  three  1.200000  2.400000

In [167]:
df3.loc[6] = ['d','two',2,1]

In [168]:
df3

  key1   key2     data1     data2
0    a    one  1.046569  0.337572
1    a    two  5.000000  2.000000
2    b    one -0.687432  0.241723
3    b    two -1.596871  0.133521
4    a    one -0.591613 -1.065803
5    c  three  1.200000  2.400000
6    d    two  2.000000  1.000000

### 增加列

.assign()

对于DataFrame，一个列代表这所有对象的该列属性的集合，所以添加一个列，使用的是一个数组

In [170]:
df4 = df3.assign(key3=[6,5,4,3,2,1,0])

In [172]:
df4.loc[:,'key4'] = [5,4,6,2,4,1,0]

In [173]:
df4

  key1   key2     data1     data2  key3  key4
0    a    one  1.046569  0.337572     6     5
1    a    two  5.000000  2.000000     5     4
2    b    one -0.687432  0.241723     4     6
3    b    two -1.596871  0.133521     3     2
4    a    one -0.591613 -1.065803     2     4
5    c  three  1.200000  2.400000     1     1
6    d    two  2.000000  1.000000     0     0

## 删除

.drop([names],axis)

In [177]:
df4.drop(['key4','key3'],axis=1)

  key1   key2     data1     data2
0    a    one  1.046569  0.337572
1    a    two  5.000000  2.000000
2    b    one -0.687432  0.241723
3    b    two -1.596871  0.133521
4    a    one -0.591613 -1.065803
5    c  three  1.200000  2.400000
6    d    two  2.000000  1.000000

In [178]:
df4.drop([6,5],axis=0)

  key1 key2     data1     data2  key3  key4
0    a  one  1.046569  0.337572     6     5
1    a  two  5.000000  2.000000     5     4
2    b  one -0.687432  0.241723     4     6
3    b  two -1.596871  0.133521     3     2
4    a  one -0.591613 -1.065803     2     4

In [179]:
df4.drop([6,5],axis=0).drop(['key4','key3'],axis=1)

  key1 key2     data1     data2
0    a  one  1.046569  0.337572
1    a  two  5.000000  2.000000
2    b  one -0.687432  0.241723
3    b  two -1.596871  0.133521
4    a  one -0.591613 -1.065803